# 01. Import Libraries and Data

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#create path
path = r'C:\Users\jacob\Documents\Data Analytics\Data Immersion\Achievement 4\10-2023 Instacart Basket Analysis'

In [3]:
#import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

In [4]:
#import products.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

# Data Consistency pracitce

In [5]:
df_ords.describe()

,Unnamed: 0,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [6]:
# create a dataframe
df_test = pd.DataFrame()

In [7]:
# create a mixed type column
df_test['mix'] = ['a','b',1, True]

In [8]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [9]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [10]:
df_test['mix'] = df_test['mix'].astype('str')

# Missing Values practice

In [11]:
# find missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
#create a df of only missing values
df_prods_nan = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
df_prods_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
df_prods.shape

(49693, 5)

In [15]:
#create a subset with no missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
df_prods_clean.shape

(49677, 5)

# Duplicates practice

In [17]:
#create a subset of full duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
#check number of rows in df_prods_clean
df_prods_clean.shape

(49677, 5)

In [20]:
#remove duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task

## Step 2

In [22]:
#check orders data 
df_ords.describe()

,Unnamed: 0,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

We don't really need to worry about unnamed (which should be order_id) and user_id because they are string data.

As far as the order_number goes it looks normal. People on average have placed 17 orders with instacart with the low being 1 and the high being 100. 

Day of week and hour of day look good

Days since prior order is low on the count, but that is only because if it is someone's first order it shows up as a null value. 

the only other thing to look at is the fact that the low for days since prior order is 0, which means two orders were placed in the same day. This would be the most interesting thing to look at to see if it was a instacart error or a customer choice.

## Step 3

In [23]:
#check for mixed - type data in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

Looks like there are no mixed values in any of the columns for df_ords

## Step 5

In [24]:
df_ords.isnull().sum()

Unnamed: 0                     0
user_id                        0
order_number                   0
day_of_week                    0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The reason there are so many missing values for days_since_prior_order is that when a customer places their first order there have been no days since their last order so that value shows up as null.

In [25]:
df_ords

,Unnamed: 0,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order
0,0,1,1,2,8,NaN
1,1,1,2,3,7,15.0
2,2,1,3,3,12,21.0
3,3,1,4,4,7,29.0
4,4,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,3421078,206209,10,5,18,29.0
3421079,3421079,206209,11,4,10,30.0
3421080,3421080,206209,12,1,12,18.0
3421081,3421081,206209,13,1,12,7.0
3421082,3421082,206209,14,6,14,30.0

## Step 6

In [27]:
#create a new column to identify new customers
df_ords['new_customer'] = 'Yes'

In [30]:
df_ords.loc[df_ords['days_since_prior_order'] <= 1, 'new_customer'] = 'No'

In [32]:
df_ords.head(20)

,Unnamed: 0,user_id,order_number,day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,0,1,1,2,8,NaN,Yes
1,1,1,2,3,7,15.0,No
2,2,1,3,3,12,21.0,No
3,3,1,4,4,7,29.0,No
4,4,1,5,4,15,28.0,No
5,5,1,6,2,7,19.0,No
6,6,1,7,1,9,20.0,No
7,7,1,8,1,14,14.0,No
8,8,1,9,1,16,0.0,No
9,9,1,10,4,8,30.0,No
10,10,1,11,4,8,14.0,No
11,11,2,1,2,11,NaN,Yes
12,12,2,2,5,10,10.0,No
13,13,2,3,1,10,3.0,No
14,14,2,4,2,10,8.0,No
15,15,2,5,3,11,8.0,No
16,16,2,6,2,9,13.0,No
17,17,2,7,2,12,14.0,No
18,18,2,8,1,15,27.0,No
19,19,2,9,2,9,8.0,No

I create a new column to flag anytime there were missing values for the days_since_prior_order data to tell whether or not this person was a new customer or not. this is a little reptitive since we could also look at their order number. I am also assuming this person is a new customer because I don't know the full date span of this dataframe.

## Step 7

In [33]:
#create a subset of full duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [35]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, user_id, order_number, day_of_week, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

No full duplicates were found within the dataframe

## Step 8

No duplicates were found.

## Step 9

In [36]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_check.csv'))

In [37]:
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked'))